<!DOCTYPE html>
<html>
<head>
	<title>Books</title>
	<meta charset="utf-8">
	<link rel="stylesheet" type="text/css" href="style/style.css">
	<link rel="shortcut icon" href="style/img/sherst.png" type="image/png">
</head>
<body>
	<general>
		<div id = "header" class="general" role = "banner">
			<div class="pic">
			<a href="index.php"><img src="style/img/cool.jpg" width="1280" height="280" ></a>
		</div>
		<div class="pt17">
			<h1>Убежище Программиста</h1>
			<h3>Вся информация о программировании</h3>
		</div>
		<ul class="menu-item">
			<li class="menu-item">
				<a href="index.php">Главная</a>
			</li>
			<li class="menu-item">
				<a href="general.php">Основы</a>
			</li>
			<li class="menu-item">
				<a href="soviet.php">Советы</a>
			</li>
			<li class="menu-item">
				<a href="books.php">Книги</a>
			</li>
			<li class="menu-item">
				<a href="blog.php">Статьи</a>
			</li>
		</ul>
		</div>
	</general>
	<visual>
		<div class="block">
			<div class="pt20">
			<p>Здесь представлены книги по разным направлениям в программировании</p>
			<p><h4>Computer sinces</h4></p>
			</div>
			<div class="compsince">
				<table>
					<tr>
						<th>Алгоритмы построение и анализ</th>
						<th><a href="books/oper.pdf"><img src="style/img/picture/oper.jpg" width="180" height="250"></a></th>
						<th>Книга "Алгоритмы. Построение и анализ" удачно объединяет в себе полноту охвата и строгость изложения материала. Много книг, посвященных алгоритмам, отличается строгостью изложения материала, но страдает определенной неполнотой; другие книги охватывают огромный объем материала, но недостаточно строго излагают его. В книге "Алгоритмы. Построение и анализ" описаны самые разнообразные алгоритмы, сочетается широкий диапазон тем с глубиной и полнотой изложения; при этом изложение доступно для читателей самого разного уровня подготовки. Каждая глава книги относительно самодостаточна и может использоваться в качестве отдельной темы для изучения. Алгоритмы в книге "Алгоритмы. Построение и анализ" описаны простым человеческим языком и с применением псевдокода, который понятен любому, кто хоть в небольшой степени знаком с программированием, а пояснения принципов их работы даны без излишней математической строгости и требуют лишь элементарных знаний. </th>
					</tr>
					<tr>
						<td>SICP</td>
						<td><a href="books/ark.pdf"><img src="style/img/picture/comp.jpg" width="180" height="250"></a></td>
						<td>«Структу́ра и интерпрета́ция компью́терных програ́мм» (англ. Structure and Interpretation of Computer Programs — SICP) — классическая книга Харольда Абельсона и Джеральда Сассмана о программировании, выпущенная издательством Массачусетского технологического института в 1985 году. В институте она использовалась как учебник для начального курса программирования 6.001 с одноимённым названием (6.001 был заменён курсом 6.01, использующим Python). Помимо этого, книгу используют во многих американских учебных заведениях, имеющих курсы, так или иначе связанные с языком Scheme[1].

Используя Scheme (диалект языка LISP), авторы описали основные концепции программирования, включая абстракцию (данных и исполнения), рекурсию и метаязыковую абстракцию.

Также в книге изложена практическая реализация концепций регистровой машины и метациклического интерпретатора.

Текст второго издания книги распространяется под лицензией Creative Commons (CC BY-SA версии 4.0).[2] </td>
					</tr>
				
				</table>
				<div class="pt20">
					<p>
					<h4>Языки программирования</h4>
				</p>
				</div>
				<div class="sysprog">
					<table>
						<tr>
							<th>Hack</th>
							<th><a href="books/hack.pdf"><img src="style/img/picture/hack.jpg" width="180" height="250"></a></th>
							<th>Автор книги не учит применять известные эксплойты, а объясняет их работу и внутреннюю сущность. Вначале читатель знакомится с основами программирования на C, ассемблере и языке командной оболочки, учится исследовать регистры процессора. А усвоив материал, можно приступать к хакингу – перезаписывать память с помощью переполнения буфера, получать доступ к удаленному серверу, скрывая свое присутствие, и перехватывать соединения TCP. Изучив эти методы, можно взламывать зашифрованный трафик беспроводных сетей, успешно преодолевая системы защиты и обнаружения вторжений.

Книга дает полное представление о программировании, машинной архитектуре, сетевых соединениях и хакерских приемах. С этими знаниями ваши возможности ограничены только воображением. </th>
						</tr>
						
						<tr>
							<td>C</td>
							<td><a href="books/kr.pdf"><img src="style/img/picture/C.jpg" width="180" height="250"></a></td>
							<td>С момента публикации в 1978 г. книги "Язык программирования Си" в мире компьютеров произошла революция. Большие машины стали еще больше, а возможности персональных ЭВМ теперь сопоставимы с возможностями больших машин десятилетней давности. Язык Си за это время также изменился, хотя и не очень сильно; что же касается сферы применения Си, то она далеко вышла за рамки его начального назначения как инструментального языка операционной системы UNIX.</td>
						</tr>
						<tr>
							<td>Assembler</td>
							<td><a href="books/asm.pdf"><img src="style/img/picture/asm.jpg" width="180" height="250"></a></td>
							<td>Книга представляет собой Учебное пособие по языку ассемблер для персональных компьютеров типа IBM PC. Подробно рассмотрены команды этих ЭВМ, конструкция языка и методы программирования на нем. Изложение сопровождается многочисленными примерами.
Для студентов и преподавателей ВУЗов, для всех желающих детально изучить язык ассемблер и приемы программирования на нем.</td>
						</tr>
						
					</table>
					
				</div>
			</div>
		</div>
	</visual>
</body>
</html>