<!DOCTYPE html>
<html>
<head>
	<title>Basic</title>
	<meta charset="utf-8">
	<link rel="stylesheet" type="text/css" href="style/style.css">
	<link rel="shortcut icon" href="style//img/sherst.png" type="image/png">
</head>
<body>
	<general>
		<div id = "header" class="general" role = "banner">
			<div class="pic">
			<a href="index.php"><img src="style/img/cool.jpg" width="1280" height="280" ></a>
		</div>
		<div class="pt17">
			<h1>Убежище Программиста</h1>
			<h3>Вся информация о программировании</h3>
		</div>
		<ul class="menu-item">
			<li class="menu-item">
				<a href="index.php">Главная</a>
			</li>
			<li class="menu-item">
				<a href="general.php">Основы</a>
			</li>
			<li class="menu-item">
				<a href="soviet.php">Советы</a>
			</li>
			<li class="menu-item">
				<a href="books.php">Книги</a>
			</li>
			<li class="menu-item">
				<a href="blog.php">Статьи</a>
			</li>
		</ul>
		</div>
	</general>
	<visual>
		<div class="block">
			<div class="pt17">
			<p>Если вы зашли на данную страницу это значит только одно вы пока еще новичек в программирований и хотите как можно скорее перестать им быть, данная страница призвана помочь вам в этом.</p>
		</div>
		<div class="pt16">
			<table>
				<tr>
					<th>Компиляторы</th>
					<th>Компиляторы — это программы, которые преобразуют исходные тексты программ, написанные на языке программирования высокого уровня, в программу на машинном языке, «понятную» компьютеру. Полученный код, называемый исполняемой программой, можно устанавливать и запускать на нужном компьютере без дополнительных преобразований. Интерпретаторы выполняют аналогичную функцию, но делают это построчно всякий раз во время исполнения программы. Байт-код — это промежуточный подход, при котором программа преобразуется в промежуточный двоичный вид, интерпретируемый некой «виртуальной машиной» во время исполнения.</th>
				</tr>
				<tr>
					<td>Интерпретаторы</td>
					<td>Интерпретаторы также преобразуют код, написанный на языке программирования высокого уровня, но они делают это построчно всякий раз, когда программа запускается на выполнение. Для того чтобы программа была «понятна» компьютеру, на котором предполагается исполнять высокоуровневый код непосредственно, на нем также должна работать программа интерпретации. Интерпретаторы полезны для тестирования нового или модифицированного кода или при обучении программированию.</td>
				</tr>
				<tr>
					<td>Язык программирования</td>
					<td>Язык программирования предназначен для написания компьютерных программ, которые представляют собой набор правил, позволяющих компьютеру выполнить тот или иной вычислительный процесс, организовать управление различными объектами, и т. п. Язык программирования отличается от естественных языков тем, что предназначен для управления ЭВМ, в то время как естественные языки используются, прежде всего, для общения людей между собой. Большинство языков программирования использует специальные конструкции для определения и манипулирования структурами данных и управления процессом вычислений.</td>
				</tr>
				<tr>
					<td>Computer sciense</td>
					<td> наука о методах и процессах сбора, хранения, обработки, передачи, анализа и оценки информации с применением компьютерных технологий, обеспечивающих возможность её использования для принятия решений[1].
					Информатика включает дисциплины, относящиеся к обработке информации в вычислительных машинах и вычислительных сетях: как абстрактные, вроде анализа алгоритмов, так и конкретные, например разработка языков программирования и протоколов передачи данных. </td>
				</tr>
				<tr>
					<td>Игровые движки</td>
					<td>Список игровых движков содержит игровые движки, представляющие собой базовое программное обеспечение компьютерной или видео игры[1]. Под данным понятием рассматривается программное обеспечение, пригодное для повторного использования и расширения, и тем самым может быть рассмотрено как основание для разработки множества различных игр без существенных изменений. </td>
				</tr>
				</tr>
			</table>
		</div>
		</div>
	</visual>
</body>
</html>