<!DOCTYPE html>
<html>
<head>
	<title>Soviet</title>
	<meta charset="utf-8">
	<link rel="stylesheet" type="text/css" href="style/style.css">
	<link rel="shortcut icon" href="style//img/sherst.png" type="image/png">
</head>
<body>
	<general>
		<div id = "header" class="general" role = "banner">
			<div class="pic">
			<a href="index.php"><img src="style/img/cool.jpg" width="1280" height="280" ></a>
		</div>
		<div class="pt17">
			<h1>Убежище Программиста</h1>
			<h3>Вся информация о программировании</h3>
		</div>
		<ul class="menu-item">
			<li class="menu-item">
				<a href="index.php">Главная</a>
			</li>
			<li class="menu-item">
				<a href="general.php">Основы</a>
			</li>
			<li class="menu-item">
				<a href="soviet.php">Советы</a>
			</li>
			<li class="menu-item">
				<a href="books.php">Книги</a>
			</li>
			<li class="menu-item">
				<a href="blog.php">Статьи</a>
			</li>
		</ul>
		</div>
	</general>
	<visual>
		<div class="block">
		<div class="pt17">
			Что бы эффективно учится важно слушать тех что уже чего-то добился в данной области и по этому тут я собрал самые важные советы для всех начинающих программистов.
		</div>
		<div class="pt16">
			

<p><h4>Мотивация</h4></p>
<p>
Когда я только начинал, я просто влюбился в программирование! И это главный секрет в достижении успеха в любой сфере. Если вы делаете то, что вам нравится, вы находите это интересным и полезным (и это действительно так!) и все дальнейшие занятия будут приносить удовольствие. Поэтому мой первый совет: если вам не нравится программирование, не мучайте себя, не пытайтесь зазубрить.

Почему я так говорю? Как вы уже могли понять, мой девиз: «делать то, что в кайф». Когда вы начнете изучать программирование, вам понадобится внутренняя мотивация. Поймите, это не спринт. Это длинный-длинный марафон. Не думайте, что вы всё выучите за одну ночь. Так не бывает.
</p>
<p>
<h4>Непрерывное обучение</h4></p>
<p>

Каждый программист должен постоянно отслеживать технологические тенденции в мире IT: новые библиотеки, как, например, ReactJS в 2013 году, веб-приложения, такие как SPA, PWA и так далее.

Я не говорю, что надо учить всё подряд. Я хочу сказать, что новые технологии появляются очень быстро, поэтому учиться придется на протяжении всей жизни.

Еще один важный совет для вас: не перегружайте себя. Не надо начинать с самой тяжелой книги алгоритмов или стараться выучить все концепции программирования за раз.

Это как с желанием похудеть. Вы же не начинаете с марафона, чтобы добиться желаемого. Вместо этого можно начать с 15 минутной пробежки каждый день. Так же и с программированием, не надо учиться сутками напролет. Занимайтесь хотя бы по часу, но каждый день!

Не сравнивайте себя с опытными программистами или «гениями кода». Это мой четвертый совет. Во-первых, это вообще не разумно. Во-вторых, вы только начинаете. Сосредоточьтесь на учебе, вместо того, чтобы сравнивать себя с другими.

Практика - это ключ к успеху. Изучайте теорию и применяйте на практике. Это совет номер пять. Пытайтесь. Ошибайтесь и пытайтесь снова. Экспериментируйте! Мы поговорим об этом позже, но запомните, практика - самое главное!
</p>
<p>
<h4>Теории и Концепции</h4></p>
<p>
Очень важно понять основные концепции программирования и создать фундамент из теоретических знаний. Если вы сейчас учитесь в универе, используйте это время с пользой! Как раз в университете можно получить хорошую теоретическую базу.

Я начинал с изучения 2 крутых курсов Codecademy и CS50 at Harvard

Там я изучил основы Python на Codecademy и C в CS50. Так вот, я считаю: нужно просто начать. Выберите один язык программирования и начните с основ (переменные, циклы, структуры данных и т. д.).

Вероятно, что, когда вы выберете курсы, вас будут учить одному языку программирования. Но не переживайте! Лучше сосредоточиться на чём-то одном, но изучить досконально, чем всего понемногу.
</p>
<p>
<h4>Участвуйте во всевозможных олимпиадах, соревнованиях по программированию.</h4></p> <p>Во-первых, после тяжелой подготовки, у вас появится еще больше навыков. Во-вторых, у вас появится внутренняя уверенность. Вы будете думать «Ну насколько же я крут, раз с этим справился».

Моя цель - дать вам эффективные советы, поэтому я перечислил некоторые отличные сайты, чтобы вы начали учиться прямо сегодня.

Codeforces

Topcoder

Hacker Rank

Code Chef

Все они похожи между собой, но они реально крутые. С множеством языков программирования, алгоритмами, учебными видео и другими полезными фишками. Теперь вы можете выбрать любой и начать практиковаться :)
</p>
<p>
<h4>Создание проектов</h4></p>
<p>
Я хорошо знал теорию, выполнил много практических упражнений и почувствовал, что надо развиваться дальше. Я задумался, что же мне делать, и решил создавать проекты с нуля.

Первым проектом был мой собственный сайт. Затем я создал сайт для ресторана моей мамы и две игры: крестики-нолики и змейка. Все они были статические.

Позже я решил, что моих знаний и опыта достаточно, чтобы считать себя фулл стек разработчиком. Так, я создал книжный онлайн — магазин с админ-панелью (администратор мог добавлять новые продукты, редактировать их, удалять их... все CRUD-вещи), а клиенты могли зарегистрироваться/войти в систему, искать книги и покупать их. Я был очень рад, что смог закончить этот проект, потому что для меня это было сложно. Сейчас с уверенностью могу сказать, что я многому научился за это время. Таким было начало моей работы с коммерческими проектами.

В конце, хочется поделиться с вами советами моих друзей, которые помогли им добиться успехов в программировании:

Начинайте с простых целей и проектов и определите основные шаги для их достижения.

Забудьте про перфекционизм.


Читайте блоги, смотрите видео, посвященные программированию.

Практикуйтесь, много-много практикуйтесь.
</p>

		</div>
	</div>
	</visual>
</body>
</html>